# Yazi + dependencies
brew "fd"
brew "ffmpeg-full"
cask "font-symbols-only-nerd-font"
brew "fzf"
brew "imagemagick-full"
brew "jq"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "yazi"
brew "zoxide"

brew "anomalyco/tap/opencode"
brew "atuin"
brew "bat"
brew "btop"
brew "chezmoi"
brew "eza"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "node"
brew "reattach-to-user-namespace" if OS.mac?
brew "sesh"
brew "starship"
brew "tmux"
brew "worktrunk"
brew "zsh" if OS.linux?

cask "raycast" if OS.mac?
cask "wezterm"

# macOS active window borders
if OS.mac?
  tap "FelixKratz/formulae"
  brew "borders", restart_service: :changed
end

# Oh My Zsh
system 'sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)" "" --unattended' unless Dir.exist?("#{ENV["HOME"]}/.oh-my-zsh")
zsh_custom = ENV["ZSH_CUSTOM"] || "#{ENV["HOME"]}/.oh-my-zsh/custom"
{
  "zsh-syntax-highlighting"      => "https://github.com/zsh-users/zsh-syntax-highlighting.git",
  "zsh-autosuggestions"          => "https://github.com/zsh-users/zsh-autosuggestions",
  "zsh-completions"              => "https://github.com/zsh-users/zsh-completions.git",
  "zsh-history-substring-search" => "https://github.com/zsh-users/zsh-history-substring-search",
  "zsh-vi-mode"                  => "https://github.com/jeffreytse/zsh-vi-mode",
}.each do |name, url|
  dest = "#{zsh_custom}/plugins/#{name}"
  system "git clone #{url} #{dest}" unless Dir.exist?(dest)
end

# AI-related
system "npx ctx7 setup" if OS.linux? # Context7 MCP

# Misc
system "curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh"
system "yay -S portmaster-bin" if OS.linux?
system "curl -fsSL https://vicinae.com/install | sh" if OS.linux?
